round_1  = {
        "Ірина Кохан": [],
        "Анна Качмарчик": [],
        "Дмитро Шумський": ["Анна Качмарчик"],
        "Олена Мисишин":  ["Єлизавета Арнаута"],
        "Олена Азарова": [],
        "Юрій Сагайдак": ["Михайло Булешний"],
        "Марта Сумик": ["Ірина Кохан"],
        "Володимир Кузьма": ["Дмитро Шумський"],
        "Єлизавета Арнаута": [],
        "Артур Пельчарський": ["Олена Азарова"],
        "Наталя Юревич": [],
        "Михайло Булешний": []
        }

round_2 = {
        "Ірина Кохан": [],
        "Анна Качмарчик": ["Ірина Кохан"],
        "Дмитро Шумський": ["Анна Качмарчик"],
        "Олена Мисишин":  ["Єлизавета Арнаута", "Михайло Булешний"],
        "Олена Азарова": ["Марта Сумик"],
        "Юрій Сагайдак": ["Михайло Булешний"],
        "Марта Сумик": ["Ірина Кохан"],
        "Володимир Кузьма": ["Дмитро Шумський", "Юрій Сагайдак"],
        "Єлизавета Арнаута": ["Дмитро Шумський"],
        "Артур Пельчарський": ["Олена Азарова"],
        "Наталя Юревич": ["Артур Пельчарський"],
        "Михайло Булешний": []
        }

round_3 = {
        "Ірина Кохан": ["Олена Азарова"],
        "Анна Качмарчик": ["Ірина Кохан", "Юрій Сагайдак"],
        "Дмитро Шумський": ["Анна Качмарчик"],
        "Олена Мисишин":  ["Єлизавета Арнаута", "Михайло Булешний"],
        "Олена Азарова": ["Марта Сумик"],
        "Юрій Сагайдак": ["Михайло Булешний"],
        "Марта Сумик": ["Ірина Кохан"],
        "Володимир Кузьма": ["Дмитро Шумський", "Юрій Сагайдак"],
        "Єлизавета Арнаута": ["Дмитро Шумський", "Володимир Кузьма"],
        "Артур Пельчарський": ["Олена Азарова", "Михайло Булешний"],
        "Наталя Юревич": ["Артур Пельчарський", "Олена Мисишин", "Марта Сумик"],
        "Михайло Булешний": []
        }